Revit 2026 API

# DWFExportOptionsImageQuality Property

---

Image quality level when compressed raster format(JPEG) is used.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DWFImageQuality ImageQuality { get; set; }
```
```vb
Public Property ImageQuality As DWFImageQuality
	Get
	Set
```
```cpp
public:
property DWFImageQuality ImageQuality {
	DWFImageQuality get ();
	void set (DWFImageQuality value);
}
```
```fsharp
member ImageQuality : DWFImageQuality with get, set
```

#### Property Value

DWFImageQuality

The default value is Default.

#### Reference

DWFExportOptions Class

Autodesk.Revit.DB Namespace